Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: some people might not like seeing someone like me even smile...
es_419: SEGURAMENTE A LA GENTE NO LE GUSTA TANTO VERME SONREÍR…

source: ...and the other spends her time digging up dirt on other people.
es_419: … Y A LA OTRA LE ENCANTA AVERIGUAR SECRETOS DE LOS DEMÁS.

source: that’s all for today.
es_419: ESO ES TODO POR HOY.

source: she just gets creepier and creepier...
es_419: CADA VEZ ESTÁ PEOR...

source: hey, jeongmin! wanna hang out after school again?
es_419: ¡HOLA, JEONGMIN! ¿QUIERES SALIR OTRA VEZ DESPUÉS DE CLASES?

source: why can’t I be curious?!
es_419: ¡¿POR QUÉ NO PUEDO PREGUNTAR?!

source: I was right.
es_419: TENÍA RAZÓN.

source: I did not feel the slightest prick of my conscience at gossiping about a friend behind her back.
es_419: NO ME SENTÍ PARA NADA CULPABLE HABLANDO MAL DE UNA AMIGA A SUS ESPALDAS.

source: just one, please...
es_419: POR FAVOR, UNA…

source: I bet you wouldn’t fall for scams--
es_419: APUESTO A QUE NO CAERÍAS EN TRUCOS…

source: n-no, I...
es_419: N-NO, YO…

source: why?
es_419: ¿POR QUÉ?

source: are you kidding me? you know I fought with juhyeon!
es_419: ¿ES BROMA? ¡SABES QUE DISCUTÍ CON JUHYEON!

source: tell me a story.
es_419: CUÉNTAME ALGO.

source: blink
es_419: PLIN

source: yes, ma’am!
es_419: ¡SÍ, SEÑORA!

source: oh... really?
es_419: AH… ¿SÍ?

source: I bet that made jeongmin anxious...
es_419: SEGURO POR ESO JEONGMIN SE PUSO NERVIOSA…

source: what did you say for juhyeon to--
es_419: ¿QUÉ LE DIJISTE PARA QUE JUHYEON…?

source: I expected it, but...
es_419: NO ME SORPRENDE, PERO…

source: you went on a date recently, right? is that when you told him about this guy?
es_419: SALIERON HACE POCO, NO? AHÍ LE HABLASTE DE ESTE CHICO?

source: don’t get it twisted.
es_419: NO TE CONFUNDAS.

source: sit up
es_419: SE LEVANTA

source: scritch
es_419: CRIT

source: split into pairs and practice serving.
es_419: PRACTIQUEN EL SAQUE DE A DOS.

source: hey, I found him right away!
es_419: ¡LO ENCONTRÉ ENSEGUIDA!

source: thanks to her, I was wrongfully bullied at the beginning of the school year.
es_419: POR SU CULPA, ME HICIERON BULLYING A PRINCIPIO DE AÑO AUNQUE NO LO MERECÍA.

source: this is almost too easy.
es_419: ESTO ES TAN FÁCIL…

source: you followed us??
es_419: ¿NOS SEGUISTE?

source: did she really threaten to kill you or something?
es_419: ¿TE AMENAZÓ DE MUERTE O ALGO ASÍ?

source: nothing is going to change.
es_419: NO CAMBIARÁ NADA.

source: juhyeon, did you see what’s happening in the hallway?
es_419: JUHYEON, ¿YA VISTE LO QUE SUCEDE EN EL PASILLO?

source: how did you start lucid dreaming?
es_419: ¿CÓMO EMPEZASTE A TENER SUEÑOS LÚCIDOS?

source: what does she like so much about him?
es_419: ¿QUÉ ES LO QUE TANTO LE GUSTA DE ÉL?

source: how could she just attack someone like that?!
es_419: ¡¿CÓMO PUEDE ATACAR A ALGUIEN ASÍ?!

source: really...?
es_419: ¿EN SERIO…?

source: she looks down on people, as if she’s so important.
es_419: MENOSPRECIA A LA GENTE COMO SI ELLA FUERA ALGUIEN IMPORTANTE.

source: I thought I had a chance.
es_419: PENSÉ QUE PODÍA SALIR BIEN.

source: I’ll try talking things out with jeongmin.
es_419: TRATARÉ DE HABLAR CON JEONGMIN.

source: if you’re free, do you want to hang out today?
es_419: ¿ENTONCES QUIERES SALIR HOY?

source: for now.
es_419: POR AHORA.

source: it was just one of his guy friends from school!
es_419: ¡SOLO ERA UN AMIGO DE LA ESCUELA!

source: ...but that kind of talk reached its limit eventually.
es_419: … PERO, CON EL TIEMPO, ME QUEDÉ SIN COSAS PARA DECIR.

source: another day went by trying to figure those two out...
es_419: OTRO DÍA EN EL QUE INTENTO COMPRENDERLAS…

source: stuff it.
es_419: CÁLLATE.

source: ...but it wasn’t easy.
es_419: … PERO NO FUE SENCILLO.

source: itchy
es_419: FRUS

source: okay.
es_419: ESTÁ BIEN.

source: and if I was mute.
es_419: ME PREGUNTÓ SI PERDÍ LA VOZ.

source: really?!
es_419: ¡¿DE VERAS?!

source: do you have anything interesting to tell me?
es_419: ¿HAY ALGO INTERESANTE QUE ME PUEDAS DECIR?

source: slouch
es_419: SE ENCORVA

source: that’s so funny, hahaha.
es_419: QUÉ DIVERTIDO. JA, JA, JA.

source: scratch
es_419: FRAS

source: oh... maybe I’ve been smiling too much lately...
es_419: AH… QUIZÁS SONREÍ DEMASIADO…

source: I’m at school!
es_419: ¡EN LA ESCUELA!

source: ah...! yes...
es_419: ¡AH…! SÍ…

source: ...but there was still a thirst that I could not quench.
es_419: … PERO AÚN HABÍA ALGO QUE NO PODÍA SATISFACER.

source: I feel suffocated...
es_419: SIENTO QUE ME FALTA EL AIRE…

source: that’s why everyone doesn’t like her.
es_419: POR ESO NO LE CAE BIEN A NADIE.

source: she’s the easiest.
es_419: ES LA MÁS FÁCIL.

source: so you’re saying that you’re stuck in between your two friends?
es_419: ¿ENTONCES ESTÁS ATRAPADA ENTRE DOS AMIGAS?

source: ...but as I kept watching you do worse things...
es_419: PERO, AL VERTE HACERLE COSAS PEORES,

source: why am I at school?
es_419: ¿POR QUÉ ESTOY EN LA ESCUELA?

source: why am I here...?!
es_419: ¡¿POR QUÉ ESTOY AQUÍ…?!

source: I’m not here to do volunteer work.
es_419: NO ESTOY AQUÍ PARA HACER TRABAJO DE VOLUNTARIO.

source: it’s just that I’m entitled to my own privacy...
es_419: ES SOLO QUE TENGO DERECHO A TENER MI PRIVACIDAD…

source: ...but it still makes me happy.
es_419: … AUN ASÍ, ME HACE FELIZ.

source: that doesn’t make any sense!
es_419: ¡NO TIENE SENTIDO!

source: everything she does is so expected of her.
es_419: ES LA ENCARNACIÓN PERFECTA DE "CHICA RARA".

source: Junyeong Kim left the chat
es_419: JUNYEONG KIM ABANDONÓ EL CHAT

source: I’m pretty sure that’s not the only reason juhyeon is mad, though.
es_419: PERO SEGURO NO ES EL ÚNICO MOTIVO POR EL QUE JUHYEON ESTÁ ENFADADA.

source: everyone is already paired up...
es_419: YA TODOS TIENEN PAREJA…

source: I told you so hahah
es_419: TE LO DIJE JAJAJA

source: chew
es_419: ÑAM

source: wow... you were a total angel for hanging out with her in the first place.
es_419: VAYA… ERAS UNA SANTA POR JUNTARTE CON ELLA…

source: bwa
es_419: JUA

source: ...someone that no one at school could ignore.
es_419: … EN ALGUIEN QUE YA NADIE PODÍA IGNORAR.

source: so don’t try to learn more about me from now on.
es_419: DE AHORA EN MÁS, NO INTENTES AVERIGUAR COSAS SOBRE MÍ.

source: I didn’t need to lucid dream.
es_419: NO NECESITABA TENER SUEÑOS LÚCIDOS.

source: even if this is a dream, I still have to commit murder myself.
es_419: AUNQUE FUERA DENTRO DE UN SUEÑO, ESTARÍA COMETIENDO UN ASESINATO.

source: ...all of the distance I’ve felt until now.
es_419: … LA DISTANCIA QUE SENTÍ ENTRE NOSOTRAS.

source: and anyways, you two said you felt bad about how eunju was treating me.
es_419: ADEMÁS, USTEDES DIJERON QUE NO LES GUSTABA CÓMO ME TRATABA EUNJU.

source: message
es_419: MENSAJE

source: Someone put a sticker of the villain on my desk :(
es_419: ALGUIEN PUSO UNA PEGATINA DEL VILLANO EN MI PUPITRE.

source: anyone who knows juhyeon’s true colors...
es_419: QUIENES CONOCEMOS A LA VERDADERA JUHYEON…

source: ...if I ask him about what he did before lucid dreaming...
es_419: … SI LE PREGUNTO QUÉ HACÍA ANTES DE TENER SUEÑOS LÚCIDOS,

source: I told you last class that we were playing volleyball today, right?
es_419: LA CLASE PASADA LES DIJE QUE JUGARÍAMOS VÓLEIBOL, ¿NO?

source: it seems like she’s living a good life.
es_419: PARECE QUE LLEVA UNA BUENA VIDA.

source: ...but he really started a conversation with me as soon as he saw me...
es_419: … PERO ME EMPEZÓ A HABLAR APENAS ME VIO…

source: please...
es_419: POR FAVOR…

source: I followed you and eunju yesterday.
es_419: AYER LAS SEGUÍ. A TI Y A EUNJU.

source: so I guess they didn’t like seeing us get along with you.
es_419: SUPONGO QUE POR ESO NO LES GUSTÓ VERNOS JUNTAS.

source: where are her friends?
es_419: ¿DÓNDE ESTÁN SUS AMIGAS?

source: I was wrong...!
es_419: ¡ME EQUIVOQUÉ!

source: we need to pick a class president now.
es_419: TENEMOS QUE ELEGIR AL PRESIDENTE DE LA CLASE.

source: it reminded me of those days.
es_419: ME ACORDÉ DE ESOS DÍAS.

source: I see you smiling at your phone a lot these days.
es_419: ÚLTIMAMENTE, TE VEO SONREÍR MUCHO CUANDO ESTÁS CON EL TELÉFONO.

source: I told you, didn’t I? you can ask me for help whenever you need it.
es_419: YA TE LO DIJE. PUEDES PEDIRME AYUDA CUANDO QUIERAS.

source: ...I’m sure you’ve read articles and urban legends about lucid dreaming at some point.
es_419: … SEGURO LEÍSTE ARTÍCULOS Y LEYENDAS URBANAS SOBRE TODO ESTO, ¿NO?

source: she’s pretty and she’s the class president?
es_419: ¿ES LINDA Y ADEMÁS LA PRESIDENTA DE LA CLASE?

source: she’s no different from normal people now.
es_419: AHORA ES IGUAL A TODOS LOS DEMÁS.

source: that’s so creepy... are you a stalker?
es_419: QUÉ HORROR… ¿ACASO ERES UNA ACOSADORA?

source: "I see"?! that sounds like I wasn't paying attention to what he was saying...!
es_419: ¡¿"YA VEO"?! ¡SUENA COMO SI NO LE PRESTARA ATENCIÓN A LO QUE ESTÁ DICIENDO…!

source: tell me about your life now.
es_419: AHORA CUÉNTAME DE TU VIDA.

source: ...and things got out of hand.
es_419: … Y TODO SE SALIÓ DE CONTROL.

source: the rumors my friends had told me were true...
es_419: LOS RUMORES QUE ME CONTARON MIS AMIGAS ERAN CIERTOS…

source: I didn’t think that I’d end up calling him like this...
es_419: NO PENSÉ QUE LO LLAMARÍA ASÍ COMO AHORA.

source: this bitch is pissing me off.
es_419: ESTA PERRA ME ESTÁ SACANDO DE QUICIO.

source: that’s all.
es_419: ESO ES TODO.

source: huh...?! my sticker!!
es_419: ¿EH…? ¡MI PEGATINA!

source: ugh seriously lol maybe i should just hang out with you guys from now on :(
es_419: UFFF SÍ XD TAL VEZ DEBERÍA JUNTARME SOLO CON USTEDES DESDE AHORA :(

source: what’s with that look on your face?
es_419: ¿POR QUÉ ESA MIRADA?

source: what, really?
es_419: ¿EN SERIO?

source: my classmates’ taunts grew more and more severe.
es_419: MIS COMPAÑERAS CADA VEZ SE ESFUERZAN MÁS PARA PROVOCARME.

source: he’s like jeongmin choi lol. you can see what they’re getting up to.
es_419: ES COMO JEONGMIN CHOI XD ENSEGUIDA SABES LO QUE PIENSAN

source: boom
es_419: BUM

source: I’m sorry...
es_419: LO SIENTO…

source: what if I can control juhyeon?
es_419: ¿Y SI PUEDO CONTROLAR A JUHYEON…?

source: knock
es_419: TOC

source: okay! let’s go!
es_419: ¡SÍ! ¡VAMOS!

source: sigh... what time did I sleep last night...?
es_419: UFF… ¿A QUÉ HORA ME DORMÍ ANOCHE…?

source: huh? what was that--
es_419: ¿EH? ¿QUÉ DIJISTE…?

source: juhyeon, why have you been staring at your phone all day?
es_419: JUHYEON, ¿POR QUÉ TE LA PASAS TANTO CON EL TELÉFONO?

source: ugh, that freak. she’s sleeping in class again.
es_419: UF, EL BICHO RARO. OTRA VEZ ESTÁ DURMIENDO EN CLASE.

source: why me...?
es_419: ¿POR QUÉ YO…?

source: oh, jeongmin! over here!
es_419: ¡AH, JEONGMIN! ¡POR AQUÍ!

source: grow up a little.
es_419: MADURA UN POCO.

source: my head is telling me no...
es_419: LA CABEZA ME DICE QUE NO…

source: didn’t you say you wanted revenge?
es_419: CREÍ QUE QUERÍAS VENGARTE.

source: it can’t be...
es_419: ES IMPOSIBLE…

source: ...that I set those suspicions aside in no time.
es_419: … QUE PRONTO ME OLVIDÉ DE LAS SOSPECHAS.

source: this.
es_419: ESTO.

source: I’ll listen to whatever you say.
es_419: DIME LO QUE QUIERAS.

source: if I'm late, who knows how I'll be humiliated in front of the class?
es_419: SI LLEGO TARDE, QUIÉN SABE CÓMO ME HUMILLARÁ FRENTE A TODA LA CLASE.

source: me, me!
es_419: ¡YO, YO!

source: ...I want to surprise her later.
es_419: QUIERO SORPRENDERLA LUEGO.

source: ah... is sora saying this because she only wants to go with me...?
es_419: AH… ¿SERÁ QUE SORA ESTÁ DICIENDO ESO PORQUE SOLO QUIERE IR CONMIGO…?

source: so what if he can kill people?
es_419: ¿QUÉ IMPORTA SI PUEDE MATAR GENTE?

source: ...is this it?
es_419: … ¿ESO ES TODO?

source: the fact that every single one of these people turned their backs on you...
es_419: EL HECHO DE QUE AHORA TODAS LAS CHICAS TE DEN LA ESPALDA…

source: what are they talking about...?
es_419: ¿DE QUÉ ESTÁN HABLANDO…?

source: I never told you to bully jeongmin, either.
es_419: TAMPOCO TE PEDÍ QUE LE HICIERAS BULLYING A JEONGMIN.

source: calendar photos camera
es_419: CALENDARIO FOTOS CÁMARA

source: this is eunju seo!
es_419: ¡Y ELLA ES EUNJU SEO!

source: hey, juhyeon.
es_419: AH, JUHYEON.

source: hmm... well...
es_419: MMM… BUENO…

source: I used to think that too...
es_419: YO SOLÍA PENSAR ESO…

source: I want to get revenge on those fuckers.
es_419: QUIERO VENGARME DE ESAS HIJAS DE PUTA.

source: you don’t have to worry about it.
es_419: NO TE PREOCUPES POR ESO.

source: her face didn’t cave in,
es_419: Y TAMPOCO LE DESTROCÉ EL ROSTRO.

source: wouldn’t it be too unfair to keep your mouth shut and graduate like this?
es_419: NO SERÍA JUSTO QUEDARNOS CALLADAS HASTA LA GRADUACIÓN, ¿NO?

source: don’t you want to get revenge on that bitch?
es_419: ¿NO QUIERES VENGARTE DE ESA PERRA?

source: what was I thinking...
es_419: EN QUÉ ESTABA PENSANDO…

source: I have no idea what she said to her,
es_419: NO SÉ QUÉ LE HABRÁ DICHO,

source: stop picking fights with jeongmin!
es_419: ¡DEJA DE BUSCAR PELEA CON JEONGMIN!

source: t-then when are you free?
es_419: ¿CUÁNDO TIENES TIEMPO?

source: thanks for the data, buddy!
es_419: ¡GRACIAS POR LOS DATOS, AMIGA!

source: why’d you stop talking?
es_419: ¿POR QUÉ DEJASTE DE HABLAR?

source: now you’re coming for the way I wear my skirt, of all things...?
es_419: ¿AHORA VAS A HACER UN ESCÁNDALO POR MI FALDA…?

source: that means...
es_419: ESO SIGNIFICA QUE…

source: bye jeongmin, see you at school!
es_419: ¡ADIÓS, JEONGMIN! ¡NOS VEMOS EN LA ESCUELA!

source: there’s nothing more to say about the incident from two years ago, since you were clearly in the wrong.
es_419: NO TENGO NADA MÁS QUE DECIR SOBRE EL INCIDENTE DE HACE DOS AÑOS. CLARAMENTE ESTABAS EQUIVOCADA.

source: you should have been nicer to me.
es_419: TENDRÍAS QUE HABER SIDO MÁS AMABLE CONMIGO.

source: ...huh?!
es_419: ¡¿EH…?!

source: I can’t think of anything else to say...
es_419: NO SÉ QUÉ DECIR…

source: hmph...
es_419: JUM…

source: are you all online?? jeongmin finally snapped
es_419: ESTÁN CONECTADAS? JEONGMIN SE VOLVIÓ LOCA

source: ...but all I can do is try my best to give it to them.
es_419: … PERO LO ÚNICO QUE PUEDO HACER ES ESFORZARME Y DÁRSELO.

source: what’s going on in real life for you to always be in a hospital gown?
es_419: ¿POR QUÉ SIEMPRE LLEVAS UNA BATA DE HOSPITAL?

source: go with yuju.
es_419: VE CON YUJU.

source: there’s nothing you can do
es_419: NO SE PUEDE EVITAR.

source: I can’t deal with you anymore.
es_419: YA NO TE SOPORTO.

source: I even enjoy hurting people in my dreams...
es_419: INCLUSO ME GUSTA LASTIMAR A OTROS EN MIS SUEÑOS…

source: the new drink here is super popular on social media, so they’ll run out of ingredients if you don’t get here early.
es_419: LA NUEVA BEBIDA QUE SIRVEN ACÁ ES TAN POPULAR EN REDES SOCIALES QUE SE QUEDAN SIN INGREDIENTES MUY RÁPIDO.

source: I’ve told you this before, but I’m just a human that’s slightly special.
es_419: YA TE LO DIJE. SOY UN HUMANO UN POCO ESPECIAL, NADA MÁS.

source: don’t waste your time on someone like her.
es_419: NO PIERDAS TIEMPO CON ALGUIEN COMO ELLA.

source: there’s a faculty meeting today, so there are no afternoon announcements.
es_419: HOY HAY REUNIÓN DE MAESTROS, ASÍ QUE NO HABRÁ ANUNCIOS POR LA TARDE.

source: ...I don’t care about any of that right now.
es_419: … ESO YA NO ME IMPORTA.

source: who is that guy..?
es_419: ¿QUIÉN ES ESE CHICO…?

source: why is she mad now?
es_419: ¿POR QUÉ ESTÁ ENOJADA?

source: think about what you did last year.
es_419: RECUERDA LO QUE HICISTE EL AÑO PASADO.

source: do you want to serve justice with me?
es_419: ¿QUIERES AYUDARME A IMPARTIR JUSTICIA?

source: what, does it taste bad?
es_419: ¿QUÉ OCURRE? ¿SABE MAL?

source: I want to drop her tbh. all she ever talks about is boys
es_419: QUIERO DEJAR DE HABLARLE, EN SERIO. SOLO SABE HABLAR DE CHICOS…

source: it’s lunchtime.
es_419: ES LA HORA DEL ALMUERZO.

source: Lucid Dreaming
es_419: SUEÑOS LÚCIDOS

source: oh right, how is she?
es_419: AH, CIERTO. CÓMO ES ELLA?

source: now she’s going to openly humiliate me?!
es_419: ¡¿AHORA QUIERE HUMILLARME DELANTE DE TODOS?!

source: everytime I try to ask this guy about himself...
es_419: CADA VEZ QUE LE PREGUNTO SOBRE SU VIDA,

source: rrrring
es_419: RING

source: packing{j}up
es_419: GUARDA

source: it’s awkward and I’m not sure what to say...
es_419: QUÉ RARO SE SIENTE TODO ESTO; NO SÉ QUÉ DECIR…

source: Soyu Kim left the chat
es_419: SOYU KIM ABANDONÓ EL CHAT

source: What a waste of oxygen
es_419: QUÉ DESPERDICIO DE OXÍGENO

source: why? who’s jeongmin choi?
es_419: ¿POR QUÉ? ¿QUIÉN ES ESA JEONGMIN CHOI?

source: I’m really, really sorry!
es_419: ¡LO SIENTO MUCHO!

source: what a freak
es_419: QUÉ BICHO RARO

source: jaehyeok and juhyeon are dating.
es_419: JAEHYEOK Y JUHYEON ESTÁN SALIENDO.

source: ...leave me alone...
es_419: … DÉJEME EN PAZ…

source: why won’t they die
es_419: POR QUÉ NO SE MUEREN

source: they’re not here to bully me, are they...?
es_419: NO VINIERON A MOLESTARME, ¿O SÍ…?

source: haha, whatever. let’s eat dinner together later, my treat.
es_419: JA, JA. COMO SEA… VAYAMOS A CENAR ALGO. YO INVITO.

source: go to your seat, I’ll call you over later.
es_419: VE A SENTARTE. LUEGO TE LLAMO.

source: they said you were probably imagining things.
es_419: DIJERON QUE SEGURAMENTE LO IMAGINASTE.

source: ...she’d be more of an outcast than I was at the beginning of the year, right?
es_419: … LA TRATARÍAN PEOR QUE A MÍ A PRINCIPIO DE AÑO, ¿NO?

source: crash
es_419: CRAC

source: there’s something I want to know...
es_419: QUIERO SABER UNA COSA…

source: do you think it’s right that juhyeon gets to abandon you and act completely fine?
es_419: ¿TE PARECE BIEN QUE JUHYEON TE ABANDONE Y SIGA ACTUANDO COMO SI NO PASARA NADA?

source: probably never.
es_419: CREO QUE NUNCA.

source: but juhyeon asked you to hang out later.
es_419: PERO ELLA TE INVITÓ A SALIR.

source: do you know who "this man" is?
es_419: ¿SABES QUIÉN ES "ESTE SUJETO"?

source: is she not coming today...?
es_419: QUIZÁS HOY NO VENGA…

source: and then she asked us to hang out with you.
es_419: Y NOS PIDIÓ QUE NOS JUNTÁRAMOS CONTIGO.

source: in this place...
es_419: EN ESTE LUGAR,

source: I’m going to find out at any cost...
es_419: CUESTE LO QUE CUESTE, LO AVERIGUARÉ…

source: oh, that’s...
es_419: AH, ES…

source: okay...!
es_419: ¡BUENO!

source: since I answered your question...
es_419: AHORA QUE RESPONDÍ TU PREGUNTA…

source: i’m having fun.
es_419: LA ESTOY PASANDO BIEN.

source: ugh, damn it.
es_419: MALDICIÓN.

source: finally, he gets it...
es_419: POR FIN LO ENTIENDE…

source: s Answer
es_419: RESPUESTA

source: ...and it’s not like looks really matter.
es_419: … Y NO CREO QUE LA APARIENCIA IMPORTE.

source: why is juhyeon alone?
es_419: ¿POR QUÉ JUHYEON ESTÁ SOLA?

source: doesn’t this screen look familiar, even from afar?
es_419: ¿NO TE RESULTA CONOCIDO ESTO, INCLUSO DESDE ALLÍ?

source: I always get called on for stuff like this.
es_419: SIEMPRE ME PIDEN QUE HAGA ESTAS COSAS.

source: sigh... now he’s not even talking.
es_419: UFF… YA NI ME HABLA…

source: anyway, as long as I have this guy...
es_419: MIENTRAS LO TENGA A ÉL…

source: ...so he’s the only person I can talk to without acting nice or fake.
es_419: … POR ESO ES EL ÚNICO CON QUIEN PUEDO HABLAR SIN APARENTAR NADA RARO.

source: the only reason she approached me...
es_419: SOLO SE ACERCÓ A MÍ…

source: what about the other friend she had?
es_419: ¿QUÉ SUCEDIÓ CON SU OTRA AMIGA?

source: don’t you even feel sorry to juhyeon?
es_419: ¿NO TE SIENTES MAL POR JUHYEON?

source: is this the truth?
es_419: ¿ESTÁ DICIENDO LA VERDAD?

source: tell me!
es_419: ¡DIME!

source: I’m super late after washing up!!
es_419: ¡SE ME HIZO TARDE PORQUE ME DUCHÉ!

source: want me to pat it better?
es_419: ¿QUIERES QUE TE HAGA SENTIR MEJOR?

source: I just came here to be alone for a while because I didn’t want to be at home.
es_419: VINE PARA ESTAR SOLA PORQUE NO QUERÍA ESTAR EN CASA.

source: in disbelief
es_419: INCRÉDULO

source: why do I have to do this kind of thing...?
es_419: ¿POR QUÉ HAGO ESTA CLASE DE COSAS?

source: remember that!
es_419: ¡NO TE OLVIDES!

source: I don’t know if I can...
es_419: NO SÉ SI PUEDO…

source: why her and not me?
es_419: ¿POR QUÉ ELLA Y NO YO?

source: I’m the one who’s been forcing myself in this whole time.
es_419: YO SOY LA QUE ESTÁ FORZANDO LA SITUACIÓN.

source: if I’ve already said this much, get it through your head.
es_419: YA TE CONTÉ TODO; DEBERÍAS ENTENDERLO.

source: don’t cry...
es_419: NO LLORES…

source: ...but we could tell that you were getting more and more worried about what we thought of you.
es_419: … PERO NOS DIMOS CUENTA DE QUE TE PREOCUPABA MUCHO LO QUE PENSÁRAMOS DE TI.

source: yuju doesn’t pay much attention to what she hears...
es_419: YUJU NO LE PRESTA ATENCIÓN A LO QUE OYE…

source: same with seungha gwon
es_419: SEUNGHA GWON ES IGUAL

source: someone got injured, but you think that’s funny, don’t you?
es_419: UNA PERSONA RESULTÓ HERIDA Y A TI TE PARECE GRACIOSO, ¿NO?

source: I can already tell!
es_419: ¡YA ME IMAGINO!

source: ...because I know that out of the three of us, I’m not the one getting kicked out.
es_419: … PORQUE SÉ QUE, DE NOSOTRAS TRES, NO SOY A QUIEN HARÁN A UN LADO.

source: was I shaking and covered in goosebumps...
es_419: ¿TEMBLABA Y SENTÍA ESCALOFRÍOS…

source: don’t be scared...
es_419: NO TENGAS MIEDO…

source: so...
es_419: ENTONCES…

source: yuju, come outside with me for a second.
es_419: YUJU, ACOMPÁÑAME AFUERA.

source: look at eunju’s face, doesn’t she look so funny? hahaha!
es_419: MIRA LA CARA DE EUNJU. ¿NO ES GRACIOSA? ¡JA, JA, JA!

source: I should go to the faculty restroom on the first floor.
es_419: MEJOR VOY AL BAÑO DE PROFESORES DEL PRIMER PISO.

source: don't try to pity me based on only what you've seen here.
es_419: NO SIENTAS LÁSTIMA POR MÍ SOLO POR LO QUE VISTE AQUÍ.

source: now’s my chance...
es_419: ES MI OPORTUNIDAD…

source: ...through lucid dreaming.
es_419: … NECESITO TENER SUEÑOS LÚCIDOS?

source: do you know how hard it was to play the villain in your place--
es_419: ¿TIENES IDEA DE LO DIFÍCIL QUE FUE SER LA VILLANA POR TI?

source: isn’t there anything I could say that would sound all right...?!
es_419: ¡¿QUÉ PUEDO DECIR QUE SUENE BIEN…?!

source: oh!
es_419: ¡AH!

source: did you tell them...?
es_419: ¿LES CONTASTE…?

source: you basically just said that you couldn’t stand me for years.
es_419: DIJISTE QUE NO ME SOPORTAS DESDE HACE AÑOS.

source: ...and a big change occurred.
es_419: … Y HUBO UN CAMBIO MUY IMPORTANTE.

source: good thinking, hyejin.
es_419: BIEN PENSADO, HYEJIN.

source: It makes me sick seeing that bitch JH act like the victim in front of her friends
es_419: ME REVUELVE EL ESTÓMAGO VER A JH ACTUAR COMO SI FUERA LA VÍCTIMA FRENTE A SUS AMIGAS

source: what...?!
es_419: ¡¿QUÉ…?!

source: you have to crush people like this so they never talk about you again.
es_419: TIENES QUE APLASTAR A LA GENTE PARA QUE NO VUELVA A HABLAR MAL SOBRE TI.

source: I was going to give you another chance if you reflected on yourself...
es_419: ESTABA DISPUESTA A DARTE OTRA OPORTUNIDAD SI REFLEXIONABAS SOBRE LO QUE HICISTE.

source: should I try lucid dreaming again?
es_419: ¿DEBERÍA INTENTAR TENER SUEÑOS LÚCIDOS OTRA VEZ?

source: h...
es_419: HO…

source: that temper of yours...
es_419: QUÉ CARÁCTER…

source: 0 Following 0 Followers
es_419: 0 SIGUIENDO 0 SEGUIDORES

source: eek, you’re going to hurt his feelings.
es_419: AYY, LE VAS A ROMPER EL CORAZÓN.

source: I didn’t hate that sora seemed to relieve the itches I was feeling.
es_419: TAMPOCO ME DESAGRADÓ QUE SORA ME HICIERA SENTIR MÁS TRANQUILA.

source: ugh...
es_419: UFF…

source: that’s a total lie.
es_419: ES MENTIRA.
